<template>
	<view>
		<h2>家塾Pro的隐私政策</h2>
		<div class="time">更新时间:2023-12-21</div>
		<h4>信息收集</h4>
		<div class="text">
		    <ul>
		        <li>可能收集的信息类型: 1.用户信息 2.电话号码 3.位置信息 4.本地存储信息等等</li>
		        <li>收集信息的方式: 由用户主动提供，不会强制获取 </li>
		        <li>收集信息的目的: 本应用收集用户信息的目的在于为用户提供更好的服务，并为用户提供更好的服务</li>
		    </ul>
		    用户信息是指用户在使用本应用时，向本应用提供的个人信息，包括但不限于用户的姓名、性别、年龄、身份证号码、手机号码、邮箱地址、头像、个性签名等。本地存储信息主要是聊天记录，本应用承诺不会收集任何用户的任何聊天记录信息
		</div>
		<h4>安全措施</h4>
		<div class="text">
		    本应用严格控制用户的访问权限，避免黑客的攻击，同时对用户信息进行加密存储，避免信息被第三方获取。
		</div>
		<h4>未成年人隐私</h4>
		<div class="text">
		    本应用尊重并保护所有未满18周岁的用户（以下称“未成年人”）。本应用将根据国家相关法律法规的规定及本应用服务协议的规定收集、使用、储存、共享、转让和保护未成年人的个人信息
		</div>
		<h4>法律遵从</h4>
		<div class="text">
		    本应用尊重用户和社会公众的合法权利，本应用将按法律法规的规定和本应用服务协议的规定对用户信息和其他个人信息进行处理。本应用将以高度的勤勉、审慎义务对待这些信息。除非获得用户的明确授权，本应用不会将这些信息对外公开或向第三方提供。
		</div>
		<h4>隐私政策的更新</h4>
		<div class="text">
		    本应用可能会不定期更新隐私政策。本应用会将更新后的隐私政策通过本应用公告的方式通知用户。本应用建议您定期查看本应用的隐私政策以了解最新的隐私政策。
		</div>
	</view>
</template>

<script>
	export default {
		data() {
			return {
				
			}
		},
		methods: {
			
		}
	}
</script>

<style scoped>
h2{
    text-align: center;
}
.time{
    font-size: 24rpx;
    color: gray;
    text-align: end;
}
.text{
    font-size: 24rpx;
	margin-bottom: 30rpx;
}
h4{
	font-size: 30rpx;
	margin-bottom: 10rpx;
	font-weight: 700;
}
</style>
